<?php
$data = array(
  #math
  array(
    #1Category
    array(
      'title' => 'Квадрат теңдеу. Квадрат теңдеудің түрлері.',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),

    #2Category
    array(
      'title' => 'Квадраттық теңдеу түбірлерінің формулалары',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),


    #3Category
    #1Category
    array(
      'title' => 'Квадрат түбірлері бар өрнектерді түрлендіру.',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),

    #4Category
    #1Category
    array(
      'title' => 'y=x функциясы және оның қасиеттері мен графигі',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),


    #5Category
    #1Category
    array(
      'title' => 'Статистикалық мәліметтерді топтау және талдау .',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),

    #6Category
    array(
      'title' => 'Квадраттық теңдеу түбірлерінің формулалары',
      'main_text' => '  Найдем решение полного квbадратного уравнения ax2 + bx + c = 0.

Решение с помощью дискриминанта
Дискриминантом квадратного уравнения D называется выражение b2 — 4ac.
При решении уравнения с помощью дискриминанта возможны три случая:
1. D > 0. Тогда корни уравнения равны:
 ⇔  ⇔
D = 0. В данном случае решение даёт два двукратных корня: x1=x2 =
3. D < 0. В этом случае уравнение не имеет решения.

Теорема Виета
Теорема Виета — сумма корней приведенного квадратного уравнения x2 + px + q = 0 равна -p, а произведение корней равно q.
Обратная теорема — если сумма двух чисел x1 и x2 равна p, а произведение этих числе равно q, то числа x1 и x2 являются корнями приведенного квадратного уравнения x2 + px + q = 0.',
      'test' => array(
        #1Question
        array(
          'question' => 'Какое из квадратных  уравнений является полным:',
          'A' => '5х2=0',
          'B' => '8-2х+3х2=0',
          'C' => '7х2+1=0',
          'D' => '6х-х2=0',
          'answer' => '1'
        ),
        #2Question
        array(
          'question' => 'Какое из квадратных  уравнений является полным:',
          'A' => '5х2-2х+3=0',
          'B' => '4х+9х2=0',
          'C' => '10х2=0',
          'D' => '6-х2=0',
          'answer' => '0'
        ),
        #3Question
        array(
          'question' => 'Дискриминант квадратного уравнения х2+5х-6=0 равен:',
          'A' => '0',
          'B' => '49',
          'C' => '1',
          'D' => '16',
          'answer' => '1'
        ),
        #4Question
        array(
          'question' => 'Дискриминант квадратного уравнения х2 -8х+7=0 равен:',
          'A' => '92',
          'B' => '-36',
          'C' => '0',
          'D' => '36',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Сколько корней имеет квадратное уравнение х2+6х+9=0',
          'A' => '1',
          'B' => '2',
          'C' => 'нет корней ',
          'D' => 'определить',
          'answer' => '0'
        ),
        #6Question
        array(
          'question' => 'Сколько корней имеет квадратное уравнение х2+5х+9=0',
          'A' => '2',
          'B' => 'нет корней',
          'C' => '1',
          'D' => 'определить невозможно',
          'answer' => '1'
        ),
        #7Question
        array(
          'question' => 'Решите уравнение х2-2х-15=0',
          'A' => 'нет корней',
          'B' => '3; -5',
          'C' => '1',
          'D' => '5; -3',
          'answer' => '1'
        ),
        #8Question
        array(
          'question' => 'Решите уравнение х2+2х-15=0',
          'A' => 'нет корней',
          'B' => '3; -5',
          'C' => '1',
          'D' => '5; -3',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Решите уравнение 4х2-4х+1=0',
          'A' => '1',
          'B' => '0,4',
          'C' => 'корней нет',
          'D' => '0,5',
          'answer' => '3'
        ),
        #10Question
        array(
          'question' => 'Решите уравнение 3х2-3х+4=0',
          'A' => '1',
          'B' => '0,4',
          'C' => 'корней нет',
          'D' => '0,5',
          'answer' => '2'
        )
      )
    ),


    #7Category
    #1Category
    array(
      'title' => 'Виет теоремасы',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),


    #8Category
    #1Category
    array(
      'title' => 'Ықтималдық теориясы туралы түсінік және математикалық статистика.',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),


    #9Category
    #1Category
    array(
      'title' => 'Трансформация  Шаршы түбір өндіру жұмысын қамтитын білдіру.',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    ),


    #10Category
    #1Category
    array(
      'title' => 'Kвадрат теңсіздік',
      'main_text' => '  ax2+bx+c=0   түрінде берілген теңдеу квадрат теңдеу деп аталады.
Мұндағы а, в, с нақты сандар. a≠0, х-айнымалы.
а -1 коэффициент, в - 2 коэффициент, с бос мүше.
Егер (1) теңдеудегі b≠0, c≠0 болса, онда ол теңдеу толық квадрат теңдеу деп аталады.
Мысалы, 3x2-8x+5=0

B немесе с, немесе B мен с нөлге тең болатын дербес жағдайлардағы квадрат теңдеу толымсыз квадрат теңдеу деп аталады.
Толымсыз квадрат теңдеулер былай жазылады.
1. ax2+bx=0, мұндағы с=0.
2. ax2+c=0, мұндағы в=0.
3. ax2=0, мұндағы в=0, с=0.

Егер толық квадрат теңдеудегі бірінші коэффициент 1-ге тең болса (а=1), онда ол келтірілген квадрат теңдеу деп аталады.
                                X2+bx+c=0.
Мысалы, 4x2-3x=0,  x(4x-3)=0,  x1=0 x2=.

4x2-9=0,   4x2=9,  x2=,   x1,2=±',
      'test' => array(
        #1Question
        array(
          'question' => '3х2-5х-2=0 теңдеуіндегі коэфиценттерді көрсет.',
          'A' => '-5; -2; 3',
          'B' => '3; -5; -2',
          'C' => '-2; 5; 3',
          'D' => '3; -2; -5',
          'answer' => '3'
        ),
        #2Question
        array(
          'question' => 'Қайсысы толық квадрат теңдеу?',
          'A' => '5а2-4а=0',
          'B' => '7а-14а2=0',
          'C' => '2х2+3х+1=0',
          'D' => '1-4у2=0',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Қайсысы толымсыз квадрат теңдеу?',
          'A' => '25=26х-х2',
          'B' => '3х2-4х-4=0',
          'C' => '4х2-9=0 ',
          'D' => 'х2+2х-48=0',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Қайсысы келтірілген квадрат теңдеу:',
          'A' => '12-х2+3х=0',
          'B' => 'х2-7х+16=0',
          'C' => '-15х2+4х-2=0',
          'D' => '4х2+х-1=0',
          'answer' => '1'
        ),
        #5Question
        array(
          'question' => 'Қайсысы келтірілмеген квадрат теңдеу:',
          'A' => 'х2+3х-5=0',
          'B' => '7х+16+х2=0',
          'C' => '12х2+4х-2=0',
          'D' => 'х2+х=0',
          'answer' => '2'
        ),
        #6Question
        array(
          'question' => 'Қай теңдеуде екінші коэффицент 0 тең:',
          'A' => 'х2-9=0',
          'B' => '5х2+2х=0',
          'C' => '2-х-х2=0 ',
          'D' => '4х2+5х-3=0',
          'answer' => '0'
        ),
        #7Question
        array(
          'question' => 'Теңдеуді шеш: 9х2-4=0',
          'A' => '±2/3',
          'B' => '4/9',
          'C' => '±3/2',
          'D' => '9/4',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Теңдеуді шеш: 3х2-75=0',
          'A' => '0; 25',
          'B' => '25; -25',
          'C' => '0; -5',
          'D' => '5; -5',
          'answer' => '3'
        ),
        #9Question
        array(
          'question' => 'Мәндердің көбейтіндісін тап 5х2+12х=0',
          'A' => '-2',
          'B' => '0',
          'C' => 'корней нет',
          'D' => '7',
          'answer' => '2'
        ),
        #10Question
        array(
          'question' => 'Мәндердің қосындысын тап 4х2+16=0',
          'A' => '10',
          'B' => '4',
          'C' => '0',
          'D' => 'корней нет',
          'answer' => '3'
        )
      )
    )
  ),


  #Fizika
  array(
    #1Category
    array(
      'title' => 'Кіріспе Жылулық қозғалыс. Броундық қозғалыс.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #2Category
    array(
      'title' => 'Температура.Температураны өлшеу әдістері.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #3CATEOGRY
    array(
      'title' => 'Ішкі энергия және оны өзгерту тәсілдері.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #4CATEGORY
    array(
      'title' => 'Жылу берілу түрлері-Жылу өткізгіштік',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),


    #5Category
    array(
      'title' => 'Жылу мөлшері. Жылу мөлшерінің бірліктері. Заттың меншікті жылу сыйымдылығы.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),


    #6Category
    array(
      'title' => 'Конвекция',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #7Category
    array(
      'title' => 'Отынның меншікті жану жылуы. Механикалық және жылу процестеріндегі энергияның сақталу және айналу заңы.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #8Category
    array(
      'title' => 'Заттың агрегаттық күйлерінің өзгеруі. Балқу және қатаю кезіндегі ішкі энергияның өзгеруі.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #9Category
    array(
      'title' => 'Ауаның ылғалдылығы.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    ),

    #10Category
    array(
      'title' => 'Қайнау. Меншікті булану жылуы.',
      'main_text' => '  Основным содержанием нового материала является определение способа расчета изменения внутренней энергии тел. Именно изменение внутренней энергии лучше характеризует поведение системы, чем конкретное значение этой энергии.
Обозначим изменение внутренней энергии через U.
Под изменением внутренней энергии будем понимать разность между конечным и начальным значением энергии:
U=U2-U1
Очевидно, что если U> 0, то внутренняя энергия увеличивается, если, то энергия уменьшается.
В общем случае изменение U может происходить либо в результате теплообмена, либо в результате совершения над системой работы, если внешние силы совершили работу А над системой, то:
U=А. Если при теплообмене система получила количество теплоты Q, то:
U=Q, Часто сама система совершает работу. Тогда:
Ас = -А.
Если система отдает при теплообмене количество теплоты Qc, то внутренняя энергия системы уменьшается, то есть:
U=QC.  Для общего случая можно записать:
U = A + Q.
Изменение внутренней энергии системы равно работе внешних сил над системой и количеству теплоты, полученному системой.
Данное выражение называют первым законом термодинамики.',
      'test' => array(
        #1Question
        array(
          'question' => 'В каких единицах измеряется внутренняя энергия тела?',
          'A' => 'Дж, кДж;',
          'B' => 'Дж/с, Дж/с;',
          'C' => 'Дж/(кг·°С), кДж/(кг·°С);',
          'D' => 'Вт, кВт.',
          'answer' => '0'
        ),
        #2Question
        array(
          'question' => 'Количеством теплоты называют ту часть внутренней энергии, которую ...',
          'A' => 'тело получает от другого тела при теплопередаче.',
          'B' => 'имеет тело.',
          'C' => 'тело получает или теряет при теплопередаче.',
          'D' => 'получает тело при совершении над ним работы.',
          'answer' => '2'
        ),
        #3Question
        array(
          'question' => 'Как надо понимать, что удельная теплоемкость цинка 380 Дж/(кг·°С)? ',
          'A' => 'Это значит, что для нагревания цинка массой 380 кг на 1 °С требуется 1 Дж энергии.',
          'B' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 1 Дж энергии.',
          'C' => 'Это значит, что для нагревания цинка массой 1 кг на 1 °С требуется 380 Дж энергии.',
          'D' => 'Это значит, что для нагревания цинка массой 1 кг на 380 °С требуется 380 Дж энергии.',
          'answer' => '2'
        ),
        #4Question
        array(
          'question' => 'Воде, спирту, керосину и растительному маслу сообщили одинаковое количество теплоты. Какая из жидкостей нагреется на большее число градусов? Массы всех жидкостей одинаковые.',
          'A' => 'Вода',
          'B' => 'Спирт',
          'C' => 'Керосин',
          'D' => 'Растительное масло',
          'answer' => '3'
        ),
        #5Question
        array(
          'question' => 'Свинцовый, латунный, железный и оловянный цилиндры равного диаметра и одинаковые по массе нагревают в горячей воде до одинаковой температуры и затем ставят на плитку парафина (рис. 100). Когда цилиндры остыли, часть парафина под ними расплавилась. Определите по рисунку, каким номером обозначен железный цилиндр.',
          'A' => 'один.',
          'B' => 'два.',
          'C' => 'три',
          'D' => 'четыре.',
          'answer' => '1'
        ),
        #6Question
        array(
          'question' => 'На каком из способов теплопередачи основано нагревание твердых тел?',
          'A' => 'Излучение',
          'B' => 'Конвекция',
          'C' => 'Теплопроводность',
          'D' => 'четыре',
          'answer' => '2'
        ),
        #7Question
        array(
          'question' => 'Какой вид теплопередачи сопровождается переносом вещества?',
          'A' => 'Конвекция',
          'B' => 'Излучение',
          'C' => 'Теплопроводность',
          'D' => 'Теплообмен',
          'answer' => '0'
        ),
        #8Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наибольшую теплопроводность?',
          'A' => 'Мех',
          'B' => 'Сталь',
          'C' => 'Дерево',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #9Question
        array(
          'question' => 'Какое из перечисленных ниже веществ имеет наименьшую теплопроводность?',
          'A' => 'Медь',
          'B' => 'Опилки',
          'C' => 'Сталь',
          'D' => 'Свинец',
          'answer' => '1'
        ),
        #10Question
        array(
          'question' => 'Металлическая ручка и деревянная дверь будут казаться на ощупь одинаково нагретыми при температуре...',
          'A' => 'ниже температуры тела',
          'B' => 'равной температуре тела',
          'C' => 'выше температуры тела',
          'D' => '',
          'answer' => '1'
        )
      )
    )

  )


);
header('Content-type: text/javascript');
$json_string = json_encode($data, JSON_PRETTY_PRINT);
echo $json_string;
 ?>
